---
kind: other
id: Methods.T:Autodesk.Revit.DB.ImportInstance
source: html/3f3ed4b4-2d17-de4f-db5f-8363d008a040.htm
---
# ImportInstance Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.